Revit 2024 API
KeyBasedTreeEntryTable.GetKeyBasedTreeEntries Method
 Gets the KeyBasedTreeEntries for this table.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public KeyBasedTreeEntries GetKeyBasedTreeEntries()
Visual Basic
Public Function GetKeyBasedTreeEntries As KeyBasedTreeEntries
Visual C++
public:
KeyBasedTreeEntries^ GetKeyBasedTreeEntries()
Return Value
 The KeyBasedTreeEntries for this table.
See Also
KeyBasedTreeEntryTable Class
Autodesk.Revit.DB Namespace